chauphuocvu/LCD-water-control-V1-14_11_2018/STM32F4xx_LCD/Project/FreeRTOS/http_client_server_socket/STM32F4Discovery/stm32f4_discovery_LCD_SSD1963.c
}

/**
  * @brief  Configures the Parallel interface (FSMC) for LCD(Parallel mode)
  * @param  None
  * @retval None
  */
void LCD_FSMCConfig(void)
{
  FSMC_NORSRAMInitTypeDef  FSMC_NORSRAMInitStructure;
  FSMC_NORSRAMTimingInitTypeDef  p;
  
	/* Enable FSMC clock */
  RCC_AHB3PeriphClockCmd(RCC_AHB3Periph_FSMC, ENABLE);

/*-- FSMC Configuration ------------------------------------------------------*/
/*----------------------- SRAM Bank1 ----------------------------------------*/
  /* FSMC_Bank1_NORSRAM1 configuration */
  p.FSMC_AddressSetupTime = 15;
  p.FSMC_AddressHoldTime = 0;
  p.FSMC_DataSetupTime = 15;
  p.FSMC_BusTurnAroundDuration = 0;
  p.FSMC_CLKDivision = 0;
  p.FSMC_DataLatency = 0;
  p.FSMC_AccessMode = FSMC_AccessMode_A;
  /* Color LCD configuration ------------------------------------
     LCD configured as follow:
        - Data/Address MUX = Disable
        - Memory Type = NOR
        - Data Width = 16bit
        - Write Operation = Enable
        - Extended Mode = Enable
        - Asynchronous Wait = Disable */

  FSMC_NORSRAMInitStructure.FSMC_Bank = FSMC_Bank1_NORSRAM1;
  FSMC_NORSRAMInitStructure.FSMC_DataAddressMux = FSMC_DataAddressMux_Disable;
  FSMC_NORSRAMInitStructure.FSMC_MemoryType = FSMC_MemoryType_NOR;
  FSMC_NORSRAMInitStructure.FSMC_MemoryDataWidth = FSMC_MemoryDataWidth_16b;
  FSMC_NORSRAMInitStructure.FSMC_BurstAccessMode = FSMC_BurstAccessMode_Disable;
  FSMC_NORSRAMInitStructure.FSMC_AsynchronousWait = FSMC_AsynchronousWait_Disable;
  FSMC_NORSRAMInitStructure.FSMC_WaitSignalPolarity = FSMC_WaitSignalPolarity_Low;
  FSMC_NORSRAMInitStructure.FSMC_WrapMode = FSMC_WrapMode_Disable;
  FSMC_NORSRAMInitStructure.FSMC_WaitSignalActive = FSMC_WaitSignalActive_BeforeWaitState;
  FSMC_NORSRAMInitStructure.FSMC_WriteOperation = FSMC_WriteOperation_Enable;
  FSMC_NORSRAMInitStructure.FSMC_WaitSignal = FSMC_WaitSignal_Disable;
  FSMC_NORSRAMInitStructure.FSMC_ExtendedMode = FSMC_ExtendedMode_Disable;
  FSMC_NORSRAMInitStructure.FSMC_WriteBurst = FSMC_WriteBurst_Disable;
  FSMC_NORSRAMInitStructure.FSMC_ReadWriteTimingStruct = &p;
  FSMC_NORSRAMInitStructure.FSMC_WriteTimingStruct = &p;

  FSMC_NORSRAMInit(&FSMC_NORSRAMInitStructure);   

  /* Enable FSMC NOR/SRAM Bank1 */
  FSMC_NORSRAMCmd(FSMC_Bank1_NORSRAM1, ENABLE);
}

void STM324xG_LCD_Reset(void)
{
	On(LCD_RST);		
	delay(1);
	Off(LCD_RST);
	delay(100);
	On(LCD_RST);
	delay(100);
	
// 	LCD_WriteCmd(CMD_SOFT_RESET);				// Soft reset
// 	delay(5);

	LCD_WriteCmd(CMD_SET_PLL_MN);
	LCD_WriteRAM(0x23);
	LCD_WriteRAM(0x02);				// Divider M = 2, PLL = 360/(M+1) = 120MHz
	LCD_WriteRAM(0x04);				// Validate M and N values
	LCD_WriteCmd(CMD_PLL_START);				// Start PLL command
	LCD_WriteRAM(0x01);
	delay(1);
	LCD_WriteCmd(CMD_PLL_START);				// Start PLL command again
	LCD_WriteRAM(0x03);				// now, use PLL output as system clock	
	LCD_WriteCmd(CMD_SOFT_RESET);				// Soft reset
	delay(10);
	
	LCD_WriteCmd(CMD_SET_PCLK);
	LCD_WriteRAM(0x01);
//	LCD_WriteRAM(0x48);
//	LCD_WriteRAM(0x9E);
	LCD_WriteRAM(0x33);
	LCD_WriteRAM(0x33);
	
	LCD_WriteCmd(CMD_SET_PANEL_MODE);
	
	LCD_WriteRAM(0x20);				// set 24-bit mode
	LCD_WriteRAM(0x00);				// set TTL mode
	LCD_WriteRAM((HDP>>8)&0X00FF); //Set panel size
	LCD_WriteRAM(HDP&0X00FF);
	LCD_WriteRAM((VDP>>8)&0X00FF);
	LCD_WriteRAM(VDP&0X00FF);
	LCD_WriteRAM(0x00);				//RGB sequence	
	//delay(5);
	
	
	LCD_WriteCmd(CMD_SET_HOR_PERIOD);
	LCD_WriteRAM((HT>>8)&0X00FF);	
	LCD_WriteRAM(HT&0X00FF);
	LCD_WriteRAM((HPS>>8)&0X00FF);
	LCD_WriteRAM(HPS&0X00FF);
	LCD_WriteRAM(HPW);
	LCD_WriteRAM((LPS>>8)&0X00FF);
	LCD_WriteRAM(LPS&0X00FF);
	LCD_WriteRAM(0x0000);	
// 	LCD_WriteRAM((HT-1)>>8);	
// 	LCD_WriteRAM(HT-1);

// 	LCD_WriteRAM((HPS-1)>>8);
// 	LCD_WriteRAM(HPS-1);
// 	LCD_WriteRAM(DISP_HOR_PULSE_WIDTH-1);
// 	LCD_WriteRAM(0x00);
// 	LCD_WriteRAM(0x00);
// 	LCD_WriteRAM(0x00);
	
	LCD_WriteCmd(CMD_SET_VER_PERIOD);
	LCD_WriteRAM((VT>>8)&0X00FF);
	LCD_WriteRAM(VT&0X00FF);
	LCD_WriteRAM((VPS>>8)&0X00FF);
	LCD_WriteRAM(VPS&0X00FF);
	LCD_WriteRAM(VPW);
	LCD_WriteRAM((FPS>>8)&0X00FF);
	LCD_WriteRAM(FPS&0X00FF);
// 	LCD_WriteRAM((VT-1)>>8);
// 	LCD_WriteRAM(VT-1);
// 	
// 	LCD_WriteRAM((VSP-1)>>8);
// 	LCD_WriteRAM(VSP-1);
// 	LCD_WriteRAM(DISP_VER_PULSE_WIDTH-1);
// 	LCD_WriteRAM(0x00);
// 	LCD_WriteRAM(0x00);

	//--------------------------------
	LCD_WriteCmd(CMD_SET_GPIO_CONF);
	LCD_WriteRAM(0x000F);
	LCD_WriteRAM(0x0001);
	
	LCD_WriteCmd(CMD_SET_GPIO_VAL);
	LCD_WriteRAM(0x0001);
	
	LCD_WriteCmd(CMD_SET_ADDR_MODE);
	LCD_WriteRAM(0x0008);
	//--------------------------------

//	LCD_WriteCmd(CMD_EXIT_SLEEP);
	LCD_WriteCmd(CMD_SET_PIXEL_FORMAT);
//	LCD_WriteRAM(0x55); 				// set 16bpp
	LCD_WriteRAM(0x50); 				// set 16bpp
	
	LCD_WriteCmd(CMD_SET_DATA_INTERFACE);
	LCD_WriteRAM(0x03);				//16-bit(565 format) data for 16bpp PIC32MX only
		
	LCD_WriteCmd(CMD_SET_POST_PROC);
	LCD_WriteRAM(0x40);
	LCD_WriteRAM(0x80);
	LCD_WriteRAM(0x40);
	LCD_WriteRAM(0x01);
	delay(1);
	
	LCD_WriteCmd(CMD_SET_TEAR_ON);
	LCD_WriteRAM(0x00);
	
	LCD_WriteCmd(CMD_ON_DISPLAY);				// Turn on display; show the image on display	
	
}

/**
  * @brief  Displays a pixel.
  * @param  x: pixel x.
  * @param  y: pixel y.  
  * @retval None
  */
void SSD1963_PutPixel(u16 x, u16 y)
{ 	
	LCD_SetArea(x,y,(LCD_PIXEL_WIDTH - 1),(LCD_PIXEL_HEIGHT - 1));
	LCD_WriteCmd(CMD_WR_MEMSTART);
	LCD_WriteRAM(TextColor);
}

/**
  * @brief  Read a pixel.
  * @param  x: pixel x.
  * @param  y: pixel y.  
  * @retval None
  */
uint16_t SSD1963_GetPixel(u16 x, u16 y)
{
	__IO uint16_t tmp = 0;
	LCD_SetArea(x,y,(LCD_PIXEL_WIDTH - 1),(LCD_PIXEL_HEIGHT - 1));
	LCD_WriteCmd(CMD_RD_MEMSTART);
	tmp = LCD_RAM;
	return tmp;
}

/*********************************************************************
* Function:  LCD_SetArea(start_x,start_y,end_x,end_y)
*
* PreCondition: SetActivePage(page)
*
* Input: start_x, end_x	- start column and end column
*		 start_y,end_y 	- start row and end row position (i.e. page address)
*
* Output: none
*
* Side Effects: none
*
* Overview: defines start/end columns and start/end rows for memory access
*			from host to SSD1963
* Note: none
********************************************************************/
void LCD_SetArea(u16 start_x, u16 start_y, u16 end_x, u16 end_y)
{
//	start_y =  start_y;
//	end_y   =  end_y;
	LCD_WriteCmd(CMD_SET_COLUMN);
	LCD_WriteRAM(start_x>>8);
	LCD_WriteRAM(start_x);
	LCD_WriteRAM(end_x>>8);
	LCD_WriteRAM(end_x);

	LCD_WriteCmd(CMD_SET_PAGE);
	LCD_WriteRAM(start_y>>8);
	LCD_WriteRAM(start_y);
	LCD_WriteRAM(end_y>>8);
	LCD_WriteRAM(end_y);
}
void LCD_SetBacklight(u8 intensity)
{
	LCD_WriteCmd(0xBE);			// Set PWM configuration for backlight control
	LCD_WriteRAM(0x0E);			// PWMF[7:0] = 2, PWM base freq = PLL/(256*(1+5))/256 = 
								// 300Hz for a PLL freq = 120MHz
	LCD_WriteRAM(intensity);		// Set duty cycle, from 0x00 (total pull-down) to 0xFF 
								// (99% pull-up , 255/256)
	LCD_WriteRAM(0x01);			// PWM enabled and controlled by host (mcu)
	LCD_WriteRAM(0x00);
	LCD_WriteRAM(0x00);
	LCD_WriteRAM(0x00);
}

/*********************************************************************
* Function:  void  SetTearingCfg(BOOL state, BOOL mode)
*
* Overview: This function enable/disable tearing effect
*
* PreCondition: none
*
* Input: 	BOOL state -	1 to enable
*							0 to disable
*			BOOL mode -		0:  the tearing effect output line consists
*								of V-blanking information only
*							1:	the tearing effect output line consists
*								of both V-blanking and H-blanking info.
* Output: none
*
* Note:
********************************************************************/
void LCD_SetTearingCfg(bool state, bool mode)
{
	if(state == 1)
	{
		LCD_WriteCmd(0x35);
		LCD_WriteRAM(mode&0x01);
	}
	else
	{
		LCD_WriteCmd(0x34);
	}
}

/**
  * @brief  Sets the LCD Text and Background colors.
  * @param  _TextColor: specifies the Text Color.
  * @param  _BackColor: specifies the Background Color.
  * @retval None
  */
void LCD_SetColors(__IO uint16_t _TextColor, __IO uint16_t _BackColor)
{
  TextColor = _TextColor; 
  BackColor = _BackColor;
}

/**
  * @brief  Gets the LCD Text and Background colors.
  * @param  _TextColor: pointer to the variable that will contain the Text Color.
  * @param  _BackColor: pointer to the variable that will contain the Background Color.
  * @retval None
  */
void LCD_GetColors(__IO uint16_t *_TextColor, __IO uint16_t *_BackColor)
{
  *_TextColor = TextColor; *_BackColor = BackColor;
}

/**
  * @brief  Sets the Text color.
  * @param  Color: specifies the Text color code RGB(5-6-5).
  * @retval None
  */
void LCD_SetTextColor(__IO uint16_t Color)
{
  TextColor = Color;
}

/**
  * @brief  Sets the Background color.
  * @param  Color: specifies the Background color code RGB(5-6-5).
  * @retval None
  */
void LCD_SetBackColor(__IO uint16_t Color)
{
  BackColor = Color;
}

/**
  * @brief  Sets the Text Font.
  * @param  fonts: specifies the font to be used.
  * @retval None
  */
void LCD_SetFont(sFONT *fonts)
{
  LCD_Currentfonts = fonts;
}

/**
  * @brief  Gets the Text Font.
  * @param  None.
  * @retval the used font.
  */
sFONT *LCD_GetFont(void)
{
  return LCD_Currentfonts;
}

/**
  * @brief  Clears the selected line.
  * @param  Line: the Line to be cleared.
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..n
  * @retval None
  */
void LCD_ClearLine(uint16_t Line)
{
  uint16_t refcolumn = 0;
  /* Send the string character by character on lCD */
  while (((refcolumn + 1)& 0xFFFF) <= (LCD_PIXEL_WIDTH - 1))
  {
    /* Display one character on LCD */
    LCD_DisplayChar(Line, refcolumn, ' ');
    /* Decrement the column position by 16 */
    refcolumn += LCD_Currentfonts->Width;
  }
}

/**
  * @brief  Clears the hole LCD.
  * @param  Color: the color of the background.
  * @retval None
  */
void LCD_Clear(uint16_t Color)
{

