chauphuocvu/LCD-water-control-V1-14_11_2018/STM32F4xx_LCD/Project/FreeRTOS/http_client_server_socket/STM32F4Discovery/stm32f4_discovery_LCD_SSD1963.c
	u32 xcounter, ycounter;

	LCD_SetArea(0,0,LCD_PIXEL_WIDTH-1,LCD_PIXEL_HEIGHT-1);

	LCD_WriteCmd(CMD_WR_MEMSTART);
		for(ycounter=0;ycounter<LCD_PIXEL_WIDTH;ycounter++)
	{
		for(xcounter=0;xcounter<LCD_PIXEL_HEIGHT;xcounter++)
		{
			LCD_WriteRAM(Color);
		}
	} 
}

/**
  * @brief  Sets the cursor position.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position. 
  * @retval None
  */
void LCD_SetCursor(uint16_t Xpos, uint16_t Ypos)
{
	LCD_SetArea(Xpos,Ypos, (Xpos + LCD_Currentfonts->Width -1), (Ypos + LCD_Currentfonts->Height -1));
}

/**
  * @brief  Draws a character on LCD.
  * @param  Xpos: the Line where to display the character shape.
  * @param  Ypos: start column address.
  * @param  c: pointer to the character data.
  * @retval None
  */
void LCD_DrawChar(uint16_t Xpos, uint16_t Ypos, const uint16_t *c)
{
  uint32_t index = 0, i = 0;
  
  LCD_SetArea(Xpos, Ypos,Xpos + LCD_Currentfonts->Width -1,Ypos + LCD_Currentfonts->Height -1);
  LCD_WriteCmd(CMD_WR_MEMSTART); /* Prepare to write GRAM */
  for(index = 0; index < LCD_Currentfonts->Height; index++)
  { 
    for(i = 0; i < LCD_Currentfonts->Width; i++)
    {
      if((((c[index] & ((0x80 << ((LCD_Currentfonts->Width / 12 ) * 8 ) ) >> i)) == 0x00) &&(LCD_Currentfonts->Width <= 12))||
        (((c[index] & (0x1 << i)) == 0x00)&&(LCD_Currentfonts->Width > 12 )))
      {
        LCD_WriteRAM(BackColor);				
      }
      else
      {
        LCD_WriteRAM(TextColor);
      }
    }
  }
}

/**
  * @brief  Draws a transparent character on LCD.
  * @param  Xpos: the Line where to display the character shape.
  * @param  Ypos: start column address.
  * @param  c: pointer to the character data.
  * @retval None
  */
void LCD_DrawCharTransparent(uint16_t Xpos, uint16_t Ypos, const uint16_t *c) /* 16bit char */
{
	  uint32_t index = 0, i = 0;

  for(index = 0; index < LCD_Currentfonts->Height; index++)
  { 
    for(i = 0; i < LCD_Currentfonts->Width; i++)
    {
      if((((c[index] & ((0x80 << ((LCD_Currentfonts->Width / 12 ) * 8 ) ) >> i)) == 0x00) &&(LCD_Currentfonts->Width <= 12))||
        (((c[index] & (0x1 << i)) == 0x00)&&(LCD_Currentfonts->Width > 12 )))
      {			
      }
      else
      {
        SSD1963_PutPixel(Xpos + i,Ypos + index);
      }
    }
  }
}

/**
  * @brief  Draws a vertical character on LCD.
  * @param  Xpos: the Line where to display the character shape.
  * @param  Ypos: start column address.
  * @param  c: pointer to the character data.
	* @param  top_down: vertical direction.
  * @retval None
  */
void LCD_DrawCharVertical(uint16_t Xpos, uint16_t Ypos, const uint16_t *c, uint16_t top_down)
{
  uint32_t index = 0, i = 0;
	
	LCD_WriteCmd(CMD_SET_ADDR_MODE);
 if (top_down == TOPTODOWN) 
 {	 
		LCD_WriteRAM(0x68);	
		LCD_SetArea(Xpos, Ypos,Xpos + LCD_Currentfonts->Height -1,Ypos + LCD_Currentfonts->Width -1);
 }
 else 
 {
	 LCD_WriteRAM(0xA8);	
	 LCD_SetArea(Xpos, Ypos - LCD_Currentfonts->Width + 1,Xpos + LCD_Currentfonts->Height -1,Ypos);
 }
  
  LCD_WriteCmd(CMD_WR_MEMSTART); /* Prepare to write GRAM */
  for(index = 0; index < LCD_Currentfonts->Height; index++)
  { 
    for(i = 0; i < LCD_Currentfonts->Width; i++)
    {
      if((((c[index] & ((0x80 << ((LCD_Currentfonts->Width / 12 ) * 8 ) ) >> i)) == 0x00) &&(LCD_Currentfonts->Width <= 12))||
        (((c[index] & (0x1 << i)) == 0x00)&&(LCD_Currentfonts->Width > 12 )))
      {
        LCD_WriteRAM(BackColor);				
      }
      else
      {
        LCD_WriteRAM(TextColor);
      }
    }
  }
	LCD_WriteCmd(CMD_SET_ADDR_MODE);	
	LCD_WriteRAM(0x08);	
}

/**
  * @brief  Draws a transparent vertical character on LCD.
  * @param  Xpos: the Line where to display the character shape.
  * @param  Ypos: start column address.
  * @param  c: pointer to the character data.
	* @param  top_down: vertical direction.
  * @retval None
  */
void LCD_DrawCharVerticalTransparent(uint16_t Xpos, uint16_t Ypos, const uint16_t *c,uint16_t top_down) /* 16bit char */
{
	  uint32_t index = 0, i = 0;
	
		uint16_t	X,Y;
	
  for(index = 0; index < LCD_Currentfonts->Height; index++)
  { 
    for(i = 0; i < LCD_Currentfonts->Width; i++)
    {
      if((((c[index] & ((0x80 << ((LCD_Currentfonts->Width / 12 ) * 8 ) ) >> i)) == 0x00) &&(LCD_Currentfonts->Width <= 12))||
        (((c[index] & (0x1 << i)) == 0x00)&&(LCD_Currentfonts->Width > 12 )))
      {			
      }
      else
      {
				if ((top_down == TOPTODOWN) ) 
					{ 
						X = Xpos + LCD_Currentfonts->Height -1 - index; 
						Y = Ypos + i;
					}
				else 
					{
						X = Xpos + index; 
						Y = Ypos - i;
					}
        SSD1963_PutPixel(X,Y);			
      }
    }
  }
}

/**
  * @brief  Displays one character (16dots width, 24dots height).
  * @param  Line: the Line where to display the character shape .
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..9
  * @param  Column: start column address.
  * @param  Ascii: character ascii code, must be between 0x20 and 0x7E.
  * @retval None
  */
void LCD_DisplayChar(uint16_t Line, uint16_t Column, uint8_t Ascii)
{
  Ascii -= 32;
//  LCD_DrawChar( Column,Line * LCD_Currentfonts->Height, &LCD_Currentfonts->table[Ascii * LCD_Currentfonts->Height]);
	LCD_DrawChar( Column,Line , &LCD_Currentfonts->table[Ascii * LCD_Currentfonts->Height]);
}
void LCD_DisplayCharTransparent(uint16_t Line, uint16_t Column, uint8_t Ascii)
{
  Ascii -= 32;
//  LCD_DrawCharTransparent( Column,Line * LCD_Currentfonts->Height, &LCD_Currentfonts->table[Ascii * LCD_Currentfonts->Height]);
	LCD_DrawCharTransparent( Column,Line, &LCD_Currentfonts->table[Ascii * LCD_Currentfonts->Height]);
}

void LCD_DisplayCharVertical(uint16_t Line, uint16_t Column, uint8_t Ascii,uint16_t top_down)
{
  Ascii -= 32;
//  LCD_DrawChar( Column,Line * LCD_Currentfonts->Height, &LCD_Currentfonts->table[Ascii * LCD_Currentfonts->Height]);
	LCD_DrawCharVertical( Column,Line , &LCD_Currentfonts->table[Ascii * LCD_Currentfonts->Height],top_down);
}
void LCD_DisplayCharVerticalTransparent(uint16_t Line, uint16_t Column, uint8_t Ascii,uint16_t top_down)
{
  Ascii -= 32;
//  LCD_DrawChar( Column,Line * LCD_Currentfonts->Height, &LCD_Currentfonts->table[Ascii * LCD_Currentfonts->Height]);
	LCD_DrawCharVerticalTransparent( Column,Line , &LCD_Currentfonts->table[Ascii * LCD_Currentfonts->Height],top_down);
}

/**
  * @brief  Displays a maximum of 20 char on the LCD.
  * @param  Line: the Line where to display the character shape .
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..9
  * @param  *ptr: pointer to string to display on LCD.
  * @retval None
  */
void LCD_DisplayStringLine(uint16_t Line, uint16_t Column, uint8_t *ptr)
{
  uint16_t refcolumn = Column;

  /* Send the string character by character on lCD */
  while ((*ptr != 0) & (((refcolumn + 1) & 0xFFFF) <= (LCD_PIXEL_WIDTH - 1)))
  {
    /* Display one character on LCD */
    LCD_DisplayChar(Line, refcolumn,*ptr);
    /* Decrement the column position by 16 */
    refcolumn += LCD_Currentfonts->Width;
    /* Point on the next character */
    ptr++;
  }
}

void LCD_DisplayAdjStringLine(uint16_t Line, uint16_t Column, uint8_t *ptr, LCD_bool Transparent_Flag)
{
  uint32_t index = 0;

	uint16_t	refcolumn = Column;
  /* Send the string character by character on lCD */
  while ((*ptr != 0) & (((refcolumn + 1) & 0xFFFF) <= (LCD_PIXEL_WIDTH - 1)))
  { /* Display one character on LCD */
		if (Transparent_Flag)	LCD_DisplayCharTransparent(Line, Column, *ptr);
		else
		LCD_DisplayChar( Line, Column, *ptr);
    
    /* Decrement the column position by GL_FontWidth */
    if ( *ptr == 'A' || *ptr == 'G' || *ptr == 'M' || *ptr == 'O' || *ptr == 'Q' || *ptr == 'X' || *ptr == 'm')
      Column += (LCD_Currentfonts->Width);
    else 
			if ( *ptr == 'i' || *ptr == 'I' || *ptr == 'l')	
				Column += (LCD_Currentfonts->Width - 5);
			else
      Column += (LCD_Currentfonts->Width - 1);
    /* Point on the next character */
    ptr++;
    /* Increment the character counter */
    index++;
  }
}

void LCD_DisplayAdjStringLineVertical(uint16_t Line, uint16_t Column, uint8_t *ptr, LCD_bool Transparent_Flag, uint16_t top_down)
{
  uint32_t index = 0;

