chauphuocvu/LCD-water-control-V1-14_11_2018/STM32F4xx_LCD/Project/FreeRTOS/http_client_server_socket/STM32F4Discovery/stm32f4_discovery_LCD_SSD1963.c
	uint16_t	refLine = Line;
	

  /* Send the string character by character on lCD */

while ((*ptr != 0))
{ /* Display one character on LCD */
	if (Transparent_Flag)	LCD_DisplayCharVerticalTransparent(refLine, Column,*ptr,top_down);
	else
		LCD_DisplayCharVertical( refLine, Column, *ptr,top_down);
    
	if (top_down == TOPTODOWN)
	{
    if ( *ptr == 'A' || *ptr == 'G' || *ptr == 'M' || *ptr == 'O' || *ptr == 'Q' || *ptr == 'X' || *ptr == 'm')
		{		
		         refLine += (LCD_Currentfonts->Width);
		}
    else 
			if ( *ptr == 'i' || *ptr == 'I' || *ptr == 'l')	
				refLine += (LCD_Currentfonts->Width - 5);
			else
      refLine += (LCD_Currentfonts->Width - 1);
    /* Point on the next character */
    ptr++;
    /* Increment the character counter */
    index++;
  }
	else
	{
    if ( *ptr == 'A' || *ptr == 'G' || *ptr == 'M' || *ptr == 'O' || *ptr == 'Q' || *ptr == 'X' || *ptr == 'm')
		{		
		         refLine -= (LCD_Currentfonts->Width);
		}
    else 
			if ( *ptr == 'i' || *ptr == 'I' || *ptr == 'l')	
				refLine -= (LCD_Currentfonts->Width - 5);
			else
      refLine -= (LCD_Currentfonts->Width - 1);
    /* Point on the next character */
    ptr++;
    /* Increment the character counter */
    index++;
  }
		
}
}

/**
  * @brief  Displays a line.
  * @param Xpos: specifies the X position.
  * @param Ypos: specifies the Y position.
  * @param Length: line length.
  * @param Direction: line direction.
  *   This parameter can be one of the following values: Vertical or Horizontal.
  * @retval None
  */
void LCD_DrawLine(uint16_t Xpos, uint16_t Ypos, uint16_t Length, uint8_t Direction)
{
	uint32_t i = 0;
		LCD_SetArea(Xpos,Ypos,(LCD_PIXEL_WIDTH - 1),(LCD_PIXEL_HEIGHT - 1));

  if(Direction == LCD_DIR_HORIZONTAL)
  {
    LCD_WriteCmd(CMD_WR_MEMSTART); /* Prepare to write GRAM */
    for(i = 0; i < Length; i++)
    {
      LCD_WriteRAM(TextColor);
    }
  }
  else
  {
    for(i = 0; i < Length; i++)
    {
      LCD_WriteCmd(CMD_WR_MEMSTART); /* Prepare to write GRAM */
      LCD_WriteRAM(TextColor);
      Ypos++;
      LCD_SetArea(Xpos,Ypos,(LCD_PIXEL_WIDTH - 1),(LCD_PIXEL_HEIGHT - 1));
    }
  }
}

/**
  * @brief  Displays a rectangle.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Height: display rectangle height.
  * @param  Width: display rectangle width.
  * @retval None
  */
void LCD_DrawRect(uint16_t Xpos, uint16_t Ypos, uint16_t Height, uint16_t Width)
{
  LCD_DrawLine(Xpos, Ypos, Width, LCD_DIR_HORIZONTAL);
  LCD_DrawLine(Xpos, Ypos + Height, Width, LCD_DIR_HORIZONTAL);
  
  LCD_DrawLine(Xpos, Ypos, Height, LCD_DIR_VERTICAL);
  LCD_DrawLine(Xpos + Width - 1, Ypos , Height, LCD_DIR_VERTICAL);
}

/**
  * @brief  Displays a circle.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Radius
  * @retval None
  */
void LCD_DrawCircle(uint16_t Xpos, uint16_t Ypos, uint16_t Radius)
{
  int32_t  D;/* Decision Variable */ 
  uint32_t  CurX;/* Current X Value */
  uint32_t  CurY;/* Current Y Value */ 
  
  D = 3 - (Radius << 1);
  CurX = 0;
  CurY = Radius;
  
  while (CurX <= CurY)
  {
		SSD1963_PutPixel(Xpos + CurX, Ypos + CurY);
		
		SSD1963_PutPixel(Xpos + CurX, Ypos - CurY);

    SSD1963_PutPixel(Xpos - CurX, Ypos + CurY);

    SSD1963_PutPixel(Xpos - CurX, Ypos - CurY);

    SSD1963_PutPixel(Xpos + CurY, Ypos + CurX);

    SSD1963_PutPixel(Xpos + CurY, Ypos - CurX);

    SSD1963_PutPixel(Xpos - CurY, Ypos + CurX);

    SSD1963_PutPixel(Xpos - CurY, Ypos - CurX);

    if (D < 0)
    { 
      D += (CurX << 2) + 6;
    }
    else
    {
      D += ((CurX - CurY) << 2) + 10;
      CurY--;
    }
    CurX++;
  }
}

void LCD_DrawFullCircle(uint16_t Xpos, uint16_t Ypos, uint16_t Radius)
{
  int32_t  D;/* Decision Variable */ 
  uint32_t  CurX;/* Current X Value */
  uint32_t  CurY;/* Current Y Value */ 
  
  D = 3 - (Radius << 1);
  CurX = 0;
  CurY = Radius;
  
  while (CurX <= CurY)
  {
    LCD_DrawLine(Xpos - CurY, Ypos + CurX, 2*(CurY),LCD_DIR_HORIZONTAL);
		
    LCD_DrawLine(Xpos - CurY, Ypos - CurX, 2*(CurY),LCD_DIR_HORIZONTAL);
		
		LCD_DrawLine(Xpos - CurX, Ypos + CurY, 2*(CurX),LCD_DIR_HORIZONTAL);
		
    LCD_DrawLine(Xpos - CurX, Ypos - CurY, 2*(CurX),LCD_DIR_HORIZONTAL);
		

    if (D < 0)
    { 
      D += (CurX << 2) + 6;
    }
    else
    {
      D += ((CurX - CurY) << 2) + 10;
      CurY--;
    }
    CurX++;
  }
}

/**
  * @brief  Displays a mono-color picture.
  * @param  Pict: pointer to the picture array.
  * @retval None
  */
void LCD_DrawMonoBMP(const uint8_t *Pict, uint16_t Xpos_Init, uint16_t Ypos_Init, uint16_t Height, uint16_t Width)
{
  uint32_t index = 0, i = 0;

//	GPIO_SetBits(GPIOA,GPIO_Pin_1);
	
	LCD_SetArea(Xpos_Init,Ypos_Init,Height - 1,Width -1);

	LCD_WriteCmd(CMD_WR_MEMSTART);
  for(index = 0; index < Height*Width/8; index++)
  {
    for(i = 0; i < 8; i++)
    {
      if((Pict[index] & (1 << i)) == 0x00)
      {
        LCD_WriteRAM(BackColor);
      }
      else
      {
        LCD_WriteRAM(TextColor);

      }
    }
  }
}

/**
  * @brief  Copy 2 bytes from bitmap array to 16Bit buffer
  * @param  ptrBitmap - Bitmap pointer
  * @param  ptr16BitBuffer - 16Bit buffer to fill
  * @retval None
  */
void BmpBuffer16BitRead(uint16_t* ptr16BitBuffer, uint8_t* ptrBitmap)
{
  *ptr16BitBuffer = (*ptrBitmap) | ((*(ptrBitmap + 1)) << 8);
}
/**
  * @brief  Copy 4 bytes from bitmap array to 32Bit buffer
  * @param  ptrBitmap - Bitmap pointer
  * @param  ptr32BitBuffer - 32Bit buffer to fill
  * @retval None
  */
void BmpBuffer32BitRead(uint32_t* ptr32BitBuffer, uint8_t* ptrBitmap)
{
  *ptr32BitBuffer = 0;
  *ptr32BitBuffer = (*ptrBitmap);
  *ptr32BitBuffer += (*(ptrBitmap + 1)) << 8;
  *ptr32BitBuffer += (*(ptrBitmap + 2)) << 16;
  *ptr32BitBuffer += (*(ptrBitmap + 3)) << 24;
}


//void LCD_DrawColorBMP(uint8_t* ptrBitmap, uint16_t Xpos_Init, uint16_t Ypos_Init)
//{
//	uint32_t uDataAddr = 0, uBmpSize = 0;
//	uint32_t	width,height;
//  uint16_t uBmpData;
//	uint8_t		*startDataPtr;
//	uint8_t		*DataPtr;
//	int32_t		i,j;
//	
//  BmpBuffer32BitRead(&uBmpSize,  ptrBitmap + 2);
//  BmpBuffer32BitRead(&uDataAddr, ptrBitmap + 10);
//	BmpBuffer32BitRead(&width,  ptrBitmap + 0x12);
//	BmpBuffer32BitRead(&height, ptrBitmap + 0x16);
//	startDataPtr = ptrBitmap + uDataAddr;
//  
//  LCD_SetArea(Xpos_Init,Ypos_Init,Xpos_Init+width - 1,Ypos_Init+height - 1);
//	LCD_WriteCmd(CMD_WR_MEMSTART);
//	for(i=height-1;i>=0;i--)
//	{
//		DataPtr = startDataPtr + 2*i*width;
//		for(j=0;j<width;j++)
//		{
//			uBmpData = (uint16_t)(*(DataPtr)) | (uint16_t)((*(DataPtr + 1)) << 8);
//			LCD_WriteRAM( uBmpData );
//			DataPtr +=2;
//		}
//	}
//}

/**
  * @brief  Displays a full rectangle.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * Height: specified in the bitmap file.
  * Width: 	specified in the bitmap file.
  * @retval None
  */
void LCD_DrawFullRect(uint16_t Xpos, uint16_t Ypos, uint16_t Width, uint16_t Height,uint16_t color)
{
	int i;
	LCD_SetArea(Xpos,Ypos,Xpos+Width - 1,Ypos+Height - 1);
	LCD_WriteCmd(CMD_WR_MEMSTART);
	for(i=0;i<Width*Height;i++)	LCD_WriteRAM( color );
}

/**
  * @brief  Displays a full circle.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position.
  * @param  Radius
  * @retval None
  */
//void LCD_DrawFullCircle(uint16_t Xpos, uint16_t Ypos, uint16_t Radius,uint16_t color)
//{
//   uint32_t n = 2;
//	uint16_t tmp = TextColor;
//  LCD_DrawCircle( Xpos , Ypos , Radius);
//  LCD_DrawCircle( Xpos , Ypos , Radius - 1);
//  LCD_SetTextColor(color);
//  for (; n < Radius; n++)
//  {
//    LCD_DrawCircle( Xpos, Ypos, Radius - n);
//  }
//	 LCD_SetTextColor(tmp);
//}

/**
  * @brief  Displays an uni-line (between two points).
  * @param  x1: specifies the point 1 x position.
  * @param  y1: specifies the point 1 y position.
  * @param  x2: specifies the point 2 x position.
  * @param  y2: specifies the point 2 y position.
  * @retval None
  */
void LCD_DrawUniLine(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2)
{
  int16_t deltax = 0, deltay = 0, x = 0, y = 0, xinc1 = 0, xinc2 = 0, 
  yinc1 = 0, yinc2 = 0, den = 0, num = 0, numadd = 0, numpixels = 0, 
  curpixel = 0;
  
